---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurveDeterminesOrientation
source: html/f46f4ac5-a833-8809-ab73-0cf793db1f70.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurveDeterminesOrientation Property

"Determines Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId CurveDeterminesOrientation { get; }
```